app.factory('$iidata', ['$http', function ($http) {

//    var _iidata = {
//        關於我們: {
//            輪撥圖: [],
//            關於我們: ,
//            公司理念: string
//            經營目標: string,
//        課程介紹: 
//            ??
//            粉絲團: facebook_link
//        },
//        師資團隊:{
//        輪撥圖: [],
//        科目: [{
//            名稱:
//            }
//        ],
//        老師:[{
//            大頭照:
//                姓名:
//        暱稱:
//        經歷:
//                }]
//        最新消息:[
//            {
//                tag的圖
//                大標
//                小標
//                內文
//             }
//        ]
    
//        我的課程:
//            當月所有行程:
//                [
//                    {
//                        時間
//                        tag的圖
//                        大標
//                        小標
//                        內文
//                    }
//                ]
//        }












//};


return {
    iidata: _iidata
};

}]);